---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationWidth
source: html/722e375a-a2b6-02fa-06f2-0ad92a8bb420.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationWidth Property

"Width"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFoundationWidth { get; }
```